[
 {
   "Timestamp": "2/11/2020 18:46:56",
   "Crop": "Apple",
   "Img": "https://media.istockphoto.com/vectors/simple-apple-in-flat-style-vector-illustration-vector-id1141529240?k=20&m=1141529240&s=612x612&w=0&h=_j9z-sPT6AqFDSSXHnSYWrXOvDOgyMmSdTUrBiZULCo=",
   "Season": "Rabi",
   "Type": "Cash Crop",
   "Description": "Apple trees are large if grown from seed. Generally, apple cultivars are propagated by grafting onto rootstocks, which control the size of the resulting tree. There are more than 7,500 known cultivars of apples, resulting in a range of desired characteristics. Different cultivars are bred for various tastes and use, including cooking, eating raw and cider production. Trees and fruit are prone to a number of fungal, bacterial and pest problems, which can be controlled by a number of organic and non-organic means. In 2010, the fruit's genome was sequenced as part of research on disease control and selective breeding in apple production.",
   "Disease-A name": "Apple Scab",
   "Disease-A Symptoms": "Pale yellow or olive green spots on upper portion of the leaves.",
   "Disease-A  Precautions": "1.Rake under trees and destroy infected leaves to reduce the number of fungal spores available to start the disease cycle over again next spring.\n2.Water in the evening or early morning hours (avoid overhead irrigation) to give the leaves time to dry out before infection can occur.",
   "Disease-A Solution": "To reduce the number of available overwintering spores present, apply a 5% solution of urea (46-0-0) in water to apple trees as leaves begin to fall in the autumn to aid in the breakdown of leaf tissue",
   "Disease-B name": "Fire blight",
   "Disease-B Symptoms": "1.The bark of infected rootstocks may show water-soaking, a purplish to black discoloration, cracking, and signs of bacterial ooze.\n2.Red-brown to black streaking may be apparent in wood just under the bark ",
   "Disease-B  Precautions": "1.Avoid heavy pruning or excess applications of nitrogen fertilizer.\n2.Avoid planting close to wild plants of hawthorn, apple or pear. As soon as fire blight is discovered, prune off infected branches 1 foot below the diseased sections and burn them to prevent further infection.",
   "Disease-B Solution": "1.Spray streptomycin at bloom. Streptomycin is an antibiotic that can kill fire blight bacteria before they enter the apple tree.\n2.The nectaries of the flowers are where bacteria enter apple trees, so it is critical that streptomycin is applied while the flowers are open."
 },
 {
   "Timestamp": "2/11/2020 19:00:33",
   "Crop": "Rice",
   "Img": "https://media.istockphoto.com/vectors/rice-bowl-realistic-vector-illustration-vector-id947519394?k=20&m=947519394&s=612x612&w=0&h=K7vUePBUJo1y55zLJcvIr3V-KNAAbM3nI6RFW11qQPA=",
   "Season": "Karif",
   "Type": "Food Crop",
   "Description": "Rice, a monocot, is normally grown as an annual plant, although in tropical areas it can survive as a perennial and can produce a ratoon crop for up to 30 years. Rice cultivation is well-suited to countries and regions with low labor costs and high rainfall, as it is labor-intensive to cultivate and requires ample water. However, rice can be grown practically anywhere, even on a steep hill or mountain area with the use of water-controlling terrace systems. Although its parent species are native to Asia and certain parts of Africa, centuries of trade and exportation have made it commonplace in many cultures worldwide.",
   "Disease-A name": "Rice Blast",
   "Disease-A Symptoms": "The symptoms of rice blast include lesions that can be found on all parts of the plant, including leaves, leaf collars, necks, panicles, pedicels, and seeds. A recent report shows that even roots can become infected.\n",
   "Disease-A  Precautions": "1.Avoid stagnating of water in the field.\n2.Do not use high dose of nitrogenous fertilizers.",
   "Disease-A Solution": "Use a protectant fungicide so that the panicles is protected as it emerges from the boots.",
   "Disease-B name": "Sheath Blight",
   "Disease-B Symptoms": "Oval or ellipsoidal greenish gray lesions, usually 1-3 cm long, on the leaf sheath.",
   "Disease-B  Precautions": "1.Carefully control of weeds, especially on the levees. drain rice fields relatively early in the cropping season to reduce sheath blight epidemics. \n2. Use fungicide to treat seeds. improve canopy architecture by reducing seeding rate or providing wider plant spacing.",
   "Disease-B Solution": "1.Control of sheath blight has been mainly through the use of foliar fungicides.\n2.Spraying of infected plants with fungicides, such as Benomyl and Iprodione, and antibiotics, such as Validamycin and Polyoxin, is effective against the disease."
 },
 {
   "Timestamp": "2/11/2020 19:17:18",
   "Crop": "Jowar",
   "Img": "https://5.imimg.com/data5/SELLER/Default/2020/12/EL/XP/KN/3042133/jowar-500x500.jpg",
   "Season": "Karif",
   "Type": "Cash Crop",
   "Description": "Jowar is a genus of flowering plants in the grass family Poaceae. Seventeen of the 25 species are native to Australia, with the range of some extending to Africa, Asia, Mesoamerica, and certain islands in the Indian and Pacific Oceans. One species is grown for grain, while many others are used as fodder plants, either cultivated in warm climates worldwide or naturalized, in pasture lands.",
   "Disease-A name": "Charcoal Rot",
   "Disease-A Symptoms": "1.Infected roots and lower stem of the infected plant show water-soaked lesions that slowly turn brown or black.\n2.Affected stalks become soft at the base and often lodge due even to moderate wind or by bending the plants. ",
   "Disease-A  Precautions": "1.Maintaining soil moisture through irrigation, if possible, during the post- flowering period can minimize charcoal rot infestation.\n2. A balanced fertilizer program is beneficial.",
   "Disease-A Solution": "1.Use no-till systems to increase soil microbial activity and conserve soil moisture, which can reduce charcoal rot.\n2.Use supplemental irrigation to slow colonization of the plant by the charcoal rot pathogen and reduce symptom severity during drought conditions. ",
   "Disease-B name": "Gray Leaf Spot",
   "Disease-B Symptoms": "Symptoms seen on corn include leaf lesions, discoloration (chlorosis), and foliar blight.",
   "Disease-B  Precautions": "Practice a three-year or longer crop rotation to nonhosts such as small grains. Eliminate crop debris, volunteers, and weeds that can serve as alternate hosts.\nPeople also ask",
   "Disease-B Solution": "1.Apply water early in the morning only when water is needed.\n2.Avoid evening waterings which keep the leaf surface wet for long periods."
 },
 {
   "Timestamp": "2/11/2020 19:53:03",
   "Crop": "Cotton",
   "Img": "https://previews.123rf.com/images/larryrains/larryrains1605/larryrains160500901/57291856-cotton-blossom.jpg",
   "Season": "Karif",
   "Type": "Cash Crop",
   "Description": "Cotton plant is a shrub native to tropical and subtropical regions around the world, including the Americas, Africa, Egypt and India. The greatest diversity of wild cotton species is found in Mexico, followed by Australia and Africa. Cotton was independently domesticated in the Old and New Worlds.",
   "Disease-A name": "Crown Gall",
   "Disease-A Symptoms": "Crown gall symptoms include round, wart-like growths — 2 inches or larger in diameter — that appear at or just above the soil line, or on lower branches and stems.",
   "Disease-A  Precautions": "Crown gall can be avoided by using nursery stock free of suspicious bumps near the crown, former soil line, or graft union; practicing five-year rotation or avoiding replanting for that period; removing severely infected plants ",
   "Disease-A Solution": "Remove the infested plant and prune out gall tissue. Soak the entire root system and damaged areas for 15 minutes in a solution of 2 level Tbsp of Actinovate per 2-1/2 gallons of water.",
   "Disease-B name": "Boll Rot",
   "Disease-B Symptoms": "Symptoms of infection include a water soaked or greasy- appearing, circular, dark green region on the boll surface.",
   "Disease-B  Precautions": "Disease control measures include variety selection, crop\nrotation, weed control, biocontrol and chemical control.",
   "Disease-B Solution": "Cotton growers can use Cupravit  as seed treating and also as an solution for boll rot."
 },
 {
   "Timestamp": "2/11/2020 21:31:43",
   "Crop": "Bajra",
   "Img": "https://5.imimg.com/data5/JB/VV/IK/SELLER-88182283/natural-pearl-millet-500x500.png",
   "Season": "Karif",
   "Type": "Food Crop",
   "Description": "Bajra (Pearl millet) is the most widely grown type of millet in India. Millets are seeded grasses and are a healthy substitute for rice and wheat in almost all the recipes.They have high resistance against harsh climates so, they can be grown easily. Bajra flour is made by grinding the Bajra (pearl millet) grains.",
   "Disease-A name": "Cercospora leaf spot ",
   "Disease-A Symptoms": "1.Lesions at maturity are 1/8 inch in diameter and appear light gray-colored to dark tan with a brown to purple border.\n2.Severely affected leaves wither and die from coalescing lesions.",
   "Disease-A  Precautions": "Varieties appear to differ in their reaction to Cercospora leaf spot, and highly susceptible varieties should be avoided. Crop rotation, sanitation of crop debris, and weed control may also help to reduce the disease.",
   "Disease-A Solution": "Use the recommended rates of fungicides to control Cercospora leaf spot - do not cut rates. Only one application of Topsin in combination with a protectant fungicide, such as Supertin, should be used during the season. When mixing fungicides, use ¾ of the labeled rate of each fungicide.",
   "Disease-B name": "Downy Mildew",
   "Disease-B Symptoms": "1.The characteristic symptoms of the disease are pale, chlorotic, broad streaks extending from base to tip of leaves.\n2.At the advancement of disease, the leaf streaks turn brown and the leaves become shredded longitudinally.",
   "Disease-B  Precautions": "Keep the ground under infected plants clean during the fall and winter to prevent the disease from spreading. Remove and destroy any plants with serious infection.",
   "Disease-B Solution": "Seed treatment with Metalaxyl 35% at 6 g. Per kg seed controlled the disease excellently for about the first 35 days after sowing."
 },
 {
   "Timestamp": "2/11/2020 21:44:39",
   "Crop": "Termoric",
   "Img": "https://img.freepik.com/free-vector/turmeric-powder-bowl-with-turmeric-illustration_9845-310.jpg?size=338&ext=jpg",
   "Season": "Karif",
   "Type": "Food Crop",
   "Description": "Turmeric is a spice that comes from the turmeric plant. It is commonly used in Asian food. You probably know turmeric as the main spice in curry. It has a warm, bitter taste and is frequently used to flavor or color curry powders, mustards, butters, and cheeses.",
   "Disease-A name": "Rhizome Rot",
   "Disease-A Symptoms": "1.The infection starts at the collar region of the pseudostem and progresses upwards as well as downwards.\n2.Foliar symptoms appear as light yellowing of the tips of lower leaves which gradually spreads to the leaf blades.",
   "Disease-A  Precautions": "Grow the crop in light soil and avoid water stagnation. Remove diseased plant from the field. Seed treatment is a must.",
   "Disease-A Solution": "Seed treatment is a must. Keep Rhizomes in 3gm Mancozeb or 1gm Carbendazim or 3gm Ridomil M.Z or 2.5 gm Metalaxyl mixed in one litre of water solution for one hour and shade dry before planting. Drainch the soil with Mancozeb (3gm/lit) or 3gm Ridomil M.Z.",
   "Disease-B name": "Leaf Blotch",
   "Disease-B Symptoms": "1.Disease symptom appears as small, oval, rectangular or irregular brown spots on either side of the leaves which soon become dirty yellow or dark brown.\n2.The leaves also turn yellow. In severe cases the plants present a scorched appearance and the rhizome yield is reduced.",
   "Disease-B  Precautions": "Spraying Blitox or Blue copper at 3 gm/lt of water was found effective against leaf blotch",
   "Disease-B Solution": "The infected and dried leaves should be collected and burnt in order to reduce the inoculum source in the field. Spraying Cpper oxy chloride at 3 g/l of water was found effective against leaf blotch."
 },
 {
   "Timestamp": "2/12/2020 9:11:45",
   "Crop": "Groundnut",
   "Img": "https://cdn.dribbble.com/users/427368/screenshots/11415907/media/b6bb938e3f7cd72d7d081b5dba9a4ffa.jpg?compress=1&resize=400x300",
   "Season": "Karif",
   "Type": "Cash Crop",
   "Description": "Kolhapur top region by production followed by Satara , pune , dhule , sangli .\nSoil : well drained, sandy loam soil , well supplied with calcium . \nOptimum soil temperature for good germination of groundnut is 30°C. The low temperature at sowing delays germination and increases seed and seedling diseases.\nThe availability of other essential ions such as copper, boron, iron, manganese, and nitrogen may be low in alkaline soils (pH >8.5); while an acid soil (pH <6) may be deficient in molybdenum, manganese, sulfur, nitrogen, phosphorus, potassium, and calcium. Therefore, depending on soil nutrient status and the targeted yield",
   "Disease-A name": "Rust disease in Groundnut",
   "Disease-A Symptoms": "Rust can be readily recognized as orange coloured pustules that appear on the lower leaflet surface and rupture to expose masses of reddish brown urediniospores.\nPustules appear first on the lower surface and in highly susceptible cultivars the original pustules may be surrounded by colonies of secondary pustules.\nPustules may also appear on the upper surface of the leaflet.\nThe pustules are usually circular and range from 0.5 to 1.4 mm in diameter.\nThey may be formed on all aerial plant parts apart from flower and pegs.\nSeverely infected leaves turn necrotic and desiccate but are attached to the plant.",
   "Disease-A  Precautions": "Avoiding frost damage by planting early peanut varieties can help protect the plant from fungal colonization; application of appropriate foliar fungicides (e.g. benomyl), where available, can help to control the disease.",
   "Disease-A Solution": "Spray chlorothaalonil 0.2%; or mancozeb 0.25% or Hexaconazole / propaconazole to reduce disease incidence\nFoliar application of aqueous neem leaf extract @ 2-5% is useful and economical for the control of rust.",
   "Disease-B name": "Early leaf spot",
   "Disease-B Symptoms": "Small chlorotic flecks on leaf petioles, stems and pegs which enlarge and turn dark in color; lesions on upper surface of leaves usually possess a yellow halo and are reddish brown on the underside of leaves",
   "Disease-B  Precautions": "is important that effective management of leaf spot diseases be developed and applied . Cultural and chemical control measures effective against one leaf spot will normally be effective against the other .",
   "Disease-B Solution": "If disease is present, a rotation away from peanut for a period of 2-3 years is advised but is insufficient to control the disease completely; peanut crop debris should be plowed into soil after harvest and any volunteers removed from the nonhost crop; fungicides should be applied with caution as they can exacerbate other foliar diseases where they are present"
 },
 {
   "Timestamp": "2/12/2020 9:22:35",
   "Crop": "Strawberry",
   "Img": "https://thumbs.dreamstime.com/b/strawberry-vector-fresh-strawberry-illustration-strawberry-vector-fresh-strawberry-illustration-vector-isolated-white-122969877.jpg",
   "Season": "Rabi",
   "Type": "Food Crop",
   "Description": "Strawberries are consumed as a fresh fruit or can be used to produce jams, jellies or preserves.\n",
   "Disease-A name": "BOTRYTIS FRUIT ROT",
   "Disease-A Symptoms": "Strawberry flowers are highly susceptible to botrytis and may blight. However, symptoms usually are observed later on green and ripening fruit.\n\nLesions often develop on the stem end of the fruit and are caused by infected stamens or dead petals stuck to the fruit. Lesions start as small, firm, light brown spots.\n\nDuring rainy or humid weather, lesions become covered with spores, ranging from tan to gray in color. Disturbing the fruit will release a large puff of visible spores. Botrytis spores can cover the entire fruit.",
   "Disease-A  Precautions": "Physically remove infected plant parts. \nUse resistant cultivars. Under Florida conditions, ‘Camarosa', 'Carmine', 'FL Radiance', and 'FL Elyana' are less susceptible than 'Strawberry Festival', 'Treasure', and 'Sweet Charlie'",
   "Disease-A Solution": "Regularly apply a broad-spectrum protective fungicide. This suppresses disease when occurrence is low and prevents large early-season losses.\nSubstitute fungicides with specific activity against botrytis fruit rot during the second peak bloom. These fungicide applications are critical during periods with mild temperatures and prolonged wetness from rain, fog, or dew.",
   "Disease-B name": "POWDERY MILDEW",
   "Disease-B Symptoms": "Early infection symptoms include small white patches of fungus growing on lower leaf surfaces. The dense fungal growth and spore chains give these patches a powdery look. In some cultivars, there isn't much fungal mycelia growth, so the patches appear as yellow or reddish brown spots.\n\nOn heavily infected leaves, the edges curl upward.\n\nIf the fungus infects the flowers, it can produce malformed or aborted fruit.",
   "Disease-B  Precautions": "Powdery mildew often infects living, green strawberry leaves in the nursery, so transplants are the main infection source in the field .\nUse disease-free transplants.\nSurvey fields early and regularly",
   "Disease-B Solution": "Apply fungicides at the first sign of disease. This is especially important when using protective fungicides such as elemental sulfur.\nRotate fungicides to prevent resistance. Products with myclobutanil should be treated as a group since they have the same mode of action. Rotate them with other fungicides with different modes of action against powdery mildew."
 },
 {
   "Timestamp": "2/12/2020 9:30:55",
   "Crop": "Coconut",
   "Img": "https://st.depositphotos.com/3297675/4514/v/950/depositphotos_45148387-stock-illustration-coconut.jpg",
   "Season": "Rabi",
   "Type": "Cash Crop",
   "Description": "The coconut (cocos nucifera L.) is a Tropical fruit plant grown on a large scale in a number of countries in tropical and sub-tropical areas. The place of origin though contradictory, is believed to be somewhere in South Asia –Malaysia. In India, coconut palms are grown on the entire coastal belt. Major share goes to Kerala, Karnataka and Tamil Nadu followed by Goa, Maharashtra, Andhra Pradesh, and Orissa.",
   "Disease-A name": "Bud rot and nutfall",
   "Disease-A Symptoms": "Chlorosis of youngest open leaves; leaves rapidly turning necrotic; necrotic spots on leaf bases; unopened spear leaves can be pulled away from the plant easily; removal of unopened spear leaves reveals soft, pink-red tissue with foul smell; leaf necrosis spreading through central crown leaves; woody parts of plant may have water-soaked, pink lesions with dark borders; infected inflorescences abort nuts.",
   "Disease-A  Precautions": "Inspect all young palms at least once a week and clean the crown and the trunk of palms by carefully removing dried fronds and other material. This facilitates early identification of pest damage. Coal tar or used engine oil should be applied on fresh wounds on trunks and petioles.\nSeverely damaged palms, which are beyond recovery, should be cut, spilt and burnt",
   "Disease-A Solution": "Control of the disease is reliant on good sanitation practices and the use of appropriate systemic fungicides; remove all infected debris and dead trees from plantation and destroy; irrigate trees early in the day to allow surfaces to dry off during the day.",
   "Disease-B name": "Gray leaf blight ",
   "Disease-B Symptoms": "Small, yellow-brown spots on leaflets which develop gray centers and dark green borders; lesions coalesce to form large necrotic patches; tips of leaflets turning gray; canopy has blighted appearance.",
   "Disease-B  Precautions": "Decaying  breeding grounds – decaying coconut logs and stumps should be removed and burnt.\nMulch on the manure circle should be inspected periodically and replaced with fresh materials",
   "Disease-B Solution": "Disease usually only merits control in coconut nurseries as infection of mature coconut palms are rare; appropriate broad spectrum protective fungicides should be applied"
 },
 {
   "Timestamp": "2/12/2020 9:35:32",
   "Crop": "Mango",
   "Img": "https://previews.123rf.com/images/makc76/makc761804/makc76180400026/99194881-mango-vector-illustration.jpg",
   "Season": "Rabi",
   "Type": "Food Crop",
   "Description": "\nMango, Mangifera indica, is an evergreen tree in the family Anacardiaceae grown for its edible fruit. The mango tree is erect and branching with a thick trunk and broad, rounded canopy. The leaves of the tree are are shiny and dark green. They are either elliptical or lanceolate with long petioles and a leathery texture. The tree produces dense clusters of flowers with cream-pink petals on branched panicles. The mango fruit is roughly oval in shape, with uneven sides. The fruit is a drupe, with an outer flesh surrounding a stone. The flesh is soft and bright yellow-orange in color. The skin of the fruit is yellow-green to red. Mango trees can grow to a height of 45 m (148 ft) and can live for in excess of 100 years. Mango is believed to originate from India .",
   "Disease-A name": "Algal leaf spot",
   "Disease-A Symptoms": "Orange rusty spots on both upper and lower leaf surfaces which may coalesce to form large irregularly shaped patches; scraping away the orange spots reveals a grayish discoloration of the leaf lamina underneath",
   "Disease-A  Precautions": "Ensure that trees are properly pruned and fertilized to promote vigor; remove all weeds from around tree bases; employ a wider tree spacing to increase air circulation around the trees; ",
   "Disease-A Solution": "badly infested trees can be treated with copper containing fungicides",
   "Disease-B name": "Anthracnose",
   "Disease-B Symptoms": "\nSmall, dark spots on flowers; spots coalesce to cover entire panicle; infected flowers dropping from tree; dark flecks or spots with yellow halo on young leaves; dark, irregular, sunken lesions on fruit; fruits dropping from tree before ripe",
   "Disease-B  Precautions": "Susceptible mango varieties should be protected with fungicide in commercial production and the timing of the applications are critical to successful control; ",
   "Disease-B Solution": "appropriate fungicide should be applied during flowering and fruit development"
 },
 {
   "Timestamp": "4/9/2020 18:31:11",
   "Crop": "Tomato",
   "Img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSSDQmQvE-B7r4ZlkiF_c3E6ifitotwIUnymTEqM_NpAPSIsZiIUJMqu-8aS-MPxBPkNPo&usqp=CAU",
   "Season": "Rabi",
   "Type": "Food Crop",
   "Description": "Importance of tomatoes are big in maharashtra.\n",
   "Disease-A name": "Late blighy",
   "Disease-A Symptoms": "Young leaf lesions are small and appear as a dark.",
   "Disease-A  Precautions": "Allow extra room between the plants.",
   "Disease-A Solution": "Minimize irrigation,Mulch",
   "Disease-B name": "Early blight",
   "Disease-B Symptoms": "Plant as small ,brown lesions ",
   "Disease-B  Precautions": "Use resistant or tolerant tomato cultivators.",
   "Disease-B Solution": "Use crop rotation ,fertilize properly"
 },
 {
   "Timestamp": "4/9/2020 18:43:43",
   "Crop": "Wheat",
   "Img": "https://i.pinimg.com/originals/d6/bd/9d/d6bd9d864e9c7fc9b91e58f39e517d5e.jpg",
   "Season": "Rabi",
   "Type": "Food Crop",
   "Description": "This crops are down mid November.",
   "Disease-A name": "Pink seed",
   "Disease-A Symptoms": "Powdery,black lesions",
   "Disease-A  Precautions": "Crop rotation,good weed control",
   "Disease-A Solution": "Resistant varieties,cultural practice",
   "Disease-B name": "Fusarium head blight",
   "Disease-B Symptoms": "Leaf rust, tan spot",
   "Disease-B  Precautions": "Seed treatment,crop rotation",
   "Disease-B Solution": "Foliar fungicides, heavy grazing"
 },
 {
   "Timestamp": "4/9/2020 18:53:54",
   "Crop": "Sugarcane",
   "Img": "https://thumbs.dreamstime.com/b/sugar-cane-plant-green-leaves-natural-sugarcane-plantation-produce-agriculture-food-resource-drawing-isolated-white-151086350.jpg",
   "Season": "Karif",
   "Type": "Cash Crop",
   "Description": "The month of June and July the harvest of this crop.",
   "Disease-A name": "Polish boeng",
   "Disease-A Symptoms": "Knife cut symptoms",
   "Disease-A  Precautions": "Hot water treatment,smut resistance variety",
   "Disease-A Solution": "Field must be rotated with rice for one season.",
   "Disease-B name": "Red rot",
   "Disease-B Symptoms": "Later reddish with dark brown",
   "Disease-B  Precautions": "Don't take ration of affected crop.",
   "Disease-B Solution": "Select setts for planting from healthy plants in a disease free area."
 },
 {
   "Timestamp": "4/9/2020 19:05:08",
   "Crop": "Sunflower",
   "Img": "https://media.istockphoto.com/vectors/sunflower-flower-isolated-vector-id927047528",
   "Season": "Rabi",
   "Type": "Cash Crop",
   "Description": "Sunflower is a short duration crop and complete it'd life cycle in about three months.",
   "Disease-A name": "Botrytis head rot",
   "Disease-A Symptoms": "Damping off, systemic infection",
   "Disease-A  Precautions": "Under very diverse climatic condition.",
   "Disease-A Solution": "Control weeds to prevent the pathegon .",
   "Disease-B name": "Downy mildew",
   "Disease-B Symptoms": "Local lesions basal rot or stem gall.",
   "Disease-B  Precautions": "Seed treatment, apply quadris",
   "Disease-B Solution": "Phomopsis ,stem canker"
 },
 {
   "Timestamp": "4/9/2020 19:16:34",
   "Crop": "Soyabean",
   "Img": "https://i.pinimg.com/originals/98/b5/ca/98b5cab60758040bfafdf5c1ac4b3f7d.jpg",
   "Season": "Karif",
   "Type": "Food Crop",
   "Description": "Crops that are down during the Southwest monsoon season.",
   "Disease-A name": "Stem rot",
   "Disease-A Symptoms": "Light purple discoloration",
   "Disease-A  Precautions": "Cercopsora leaf blight",
   "Disease-A Solution": "Seedling",
   "Disease-B name": "Brown spot",
   "Disease-B Symptoms": "Necrotic patches",
   "Disease-B  Precautions": "Plant resistant",
   "Disease-B Solution": "Besides seed yield reduction."
 },
 {
   "Timestamp": "4/9/2020 19:24:17",
   "Crop": "Potato",
   "Img": "https://media.istockphoto.com/vectors/potato-vector-id1068867872?k=20&m=1068867872&s=612x612&w=0&h=s5XRod985qbo4wfy_R4mweVkIlaffPgk7UwTJQnatA4=",
   "Season": "Rabi",
   "Type": "Food Crop",
   "Description": "Research has made it possible to grow potato though out the season.",
   "Disease-A name": "Powdery mildew",
   "Disease-A Symptoms": "Cracked skin",
   "Disease-A  Precautions": "Removing all infected leaves",
   "Disease-A Solution": "Gap between potatoes crop",
   "Disease-B name": "Black scurf",
   "Disease-B Symptoms": "Scab like spot",
   "Disease-B  Precautions": "Rotates crops in areas ",
   "Disease-B Solution": "Removing all infected leaves and stem at a time."
 },
 {
   "Timestamp": "4/10/2020 11:33:01",
   "Crop": "Grapes",
   "Img": "https://png.vector.me/files/images/4/2/424031/grape",
   "Season": "Rabi",
   "Type": "Food Crop",
   "Description": "Maharashtra is ranked first in production of grapes, producing about 62.7 per cent of the\ntotal production of grapes in India.\n The major importing\ncountries of India's grapes were Bangladesh, Netherland, UAE, UK, Rassia , Saudi Arabia, Thailand, Sweeden, New Zealand, Malaysia, Australia, Shrilanka and Nepal respectively; these countries alone comprises of around 87 per cent of India's total export of grape .\nTemporal changes in area under grape in Nasik, Pune and Kolhapur divisions of Western Maharashtra region and Aurangabad and Latur divisions of Marathwada region have been worked out.\nThe ideal climate for grape growing is the Mediterranean climate. In its natural habitat, the vines grow and produce during the hot and dry period. Under South Indian conditions – vines produce vegetative growth during the period from April to September and then fruiting period from October to March. Temperatures above 100C to 400C influence the yield and quality. High humidity and cloudy weather invite many fungal diseases, besides lowering the T.S.S. : Acid ratio.\nThe grape is widely adopted to various soil conditions, but the yield and quality reach to the highest on good fertile soils have pH 6.5 to 8.5, organic carbon above 1.0%, free of lime and having a medium water holding capacity. Early but medium yields with high T.S.S. are harvested on medium type of soils.",
   "Disease-A name": "Downy mildew",
   "Disease-A Symptoms": "1)The fungus is an obligate pathogen which can attack all green parts of the vine.\n2)Symptoms of this disease are frequently confused with those of powdery mildew. Infected leaves develop pale yellow-green lesions which gradually turn brown. Severely infected leaves often drop prematurely.\n3)Infected petioles, tendrils, and shoots often curl, develop a shepherd's crook, and eventually turn brown and die.\n4)Young berries are highly susceptible to infection and are often covered with white fruiting structures of the fungus. Infected older berries of white cultivars may turn dull gray-green, whereas those of black cultivars turn pinkish red.",
   "Disease-A  Precautions": "1. Maintain plant vigor. Make sure soils are welldrained. Fertilize according to soil test information obtained at least every other year.\n2. Sanitation. Remove fallen leaves which are the source of overwintering inoculum.\n3. Pruning. Prune out the ends of infected shoots.",
   "Disease-A Solution": "Fungicides are an important control measure, especially on susceptible cultivars. They should be applied just before bloom, 7 to 10 days later (usually at the end of bloom), 10 to 14 days after that, and finally, 3 weeks after the third application. For cultivars very susceptible to downy mildew or where the disease was severe the previous season, an additional application is suggested about 2 weeks before the first blossom opens. Pesticides registered for use include captan, copper, fosetyl-Al, mancozeb, maneb, and ziram.",
   "Disease-B name": "Black rot",
   "Disease-B Symptoms": "1The disease attacks the leaves, stem, flowers and berries. All the new growth on the vineis prone to attack during the growing season.\n2)The symptoms are in the form of irregularly shapedreddish brown spots on the leaves and a black scab on berries.\n3)Occasionally, small elliptical darkcoloured canker lesions occur on the young stems and 4)tendrils. Leaf, cane and tendril infection canoccur only when the tissue is young, but berries can be infected until almost fully-grown if an activefungicide residue is not present.\nThe affected berries shrivel and become hard black mummies.\n",
   "Disease-B  Precautions": "1. Cultural practices that promote fast-drying of the planting following rain or dew will aid in black rot control. These practices include proper vine spacing, selection of a well-drained planting site exposed to full sun, proper pruning (refer to Extension PB 1475, Grape Growing in Tennessee) and removal of tall weeds.\n2. Reduce primary (spring) infection by burning or otherwise destroying prunings and diseased and overwintering berries and leaves. If possible, disk the soil before bud-break to bury the mummified berries and prevent the spores from reaching the vines.\n3. Many cultivars have some resistance to black rot. Reliance, Niagara, Concord and Catawaba are susceptible, whereas Fredonia and Delaware are moderately resistant. The reactions of many other cultivars are variable, apparently depending upon location and the strain of the fungus present.",
   "Disease-B Solution": "Mancozeb, and Ziram are all highly effective against black rot. Because these fungicides are\nstrictly protectants, they must be applied before the fungus infects or enters the plant. They\nprotect fruit and foliage by preventing spore germination. They will not arrest lesion\ndevelopment after infection has occurred. "
 },
 {
   "Timestamp": "4/10/2020 12:16:39",
   "Crop": "Corn",
   "Img": "https://media.istockphoto.com/vectors/fresh-corn-cob-isolated-on-white-background-corn-icon-for-market-vector-id1150557703?k=20&m=1150557703&s=612x612&w=0&h=1i0RMZ3WNEwaLXa5UUV-s2B5dXYYGbTHS1yzpziiDcI=",
   "Season": "Karif",
   "Type": "Food Crop",
   "Description": "          India is one of the top 10 maize producers in the world; it contributes around 2-3% of the total maize produced globally and is one of the top-5 maize exporters in the world contributing almost 14% of the total maize exported to different countries around the world. South-East Asia is the biggest market for Indian maize with almost 80% of the exported Indian maize going to Indonesia, Vietnam and Malaysia.\n          Nashik District is the top region by maize production in India. As of 2011, maize production in Nashik District was 546,100 tonnes that accounts for 21.95% of India's maize production. The top 5 regions (others are Aurangabad District, Maharashtra, Jalgaon District, Jalna District, and Buldana District) account for 69.01% of it.\nIt requires 50-100 cm of rainfall and it cannot be grown in areas of more than 100 cm rainfall.Crop water need 500-800 (mm/total growing period)\nThis crop usually grows well under temperatures varying from 21°C to 27°C, although it can tolerate temperatures as high as 35°C. \nClimate: Maize does well on a wide range of climatic conditions, and it is grown in the tropical as well as temperate regions, from sea-levels up to altitudes of 2500m. \nSoil: Maize can be grown successfully in variety of soils ranging from loamy sand to clay loam. However, soils with good organic matter content having high water holding capacity with neutral pH are considered good for higher productivity. Being a sensitive crop to moisture stress particularly excess soil moisture and salinity stresses; it is desirable to avoid low lying fields having poor drainage and also the field having higher salinity. \n",
   "Disease-A name": "Cercospora leaf spot (Gray leaf spot) ",
   "Disease-A Symptoms": "Small necrotic spots with chlorotic halos on leaves which expand to rectangular lesions 1-6 cm in length and 2-4 mm wide; as the lesions mature they turn tan in color and finally gray; lesions have sharp, parallel edges and are opaque; disease can develop quickly causing complete blighting of leaves and plant death.\n1. Brown Spots with yellow rings throughout the leaf during the growing period of the Cassava\n2. Lesions that are 0.15-0.2 cm in diameter\n3. Serious cases can lead to holes throughout the lesions on the leaf.",
   "Disease-A  Precautions": "Crop rotation and clean plowing are effective at reducing in-field inoculum buildup. A two-year crop rotation away from corn is effective if reduced tillage must be maintained for conservation purposes or a one-year rotation with clean plowing is recommended in fields that have had a problem with the disease.\nHybrids with partial resistance to GLS are available.",
   "Disease-A Solution": "Integrated Pest Management Options\n1)pyraclostrobin - Headline EC\n2)azoxystrobin + propiconazole - Quilt\n3)prothioconazole - Proline 480 SC\n4)propiconazole - Tilt 250 E, Bumper 418 EC",
   "Disease-B name": "Charcoal rot ",
   "Disease-B Symptoms": "symptoms are usually first apparent at the tasseling stage; plant stalks become shredded and pith is completely rotted with stringy strands of vascular tissue left intact; small, black fungal fruiting bodies are visible in the vascular strands and give the tissue a gray coloration; fungus grows into internodes of the stalk causing the plant to ripen early and causing the stalk to weaken; plant may break.",
   "Disease-B  Precautions": "avoid stressing plants by practicing good water management; rotating crops with small grains may help reduce disease incidence.",
   "Disease-B Solution": "The use of foliar fungicides for corn have also been shown to control NCLB.\nThe HtN gene delays symptoms until after the pollen shed. Individually, each Ht gene has limited effectiveness because there are races of E. turcicum that are virulent in the presence of one or the other."
 }
]